In [1]:
import numpy as np
import pandas as pd

In [2]:
date = pd.read_csv("orders.csv")
time = pd.read_csv("messages.csv")

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

### Working with Dates

In [5]:
date['date'] = pd.to_datetime(date['date'])

In [6]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

#### 1. Extract year

In [7]:
date['date_year'] = date['date'].dt.year
date.sample(3)

          date  product_id  city_id  orders  date_year
627 2018-08-01        4568       13     138       2018
542 2019-06-10        2652       18      69       2019
752 2019-06-21        6174        3      12       2019

#### 2. Extract Month

In [8]:
date['date_month_no'] = date['date'].dt.month
date.sample(3)

          date  product_id  city_id  orders  date_year  date_month_no
399 2019-10-13         149       14      37       2019             10
787 2019-07-19        5371       22       8       2019              7
891 2018-11-18        3904        1       9       2018             11

In [9]:
date['date_month_name'] = date['date'].dt.month_name()
date.sample(3)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name
278,2019-06-08,5024,21,4,2019,6,June
591,2019-10-15,5386,25,2,2019,10,October
937,2019-08-19,1047,30,5,2019,8,August

#### 3. Extract Days

In [10]:
date['date_day'] = date['date'].dt.day
date.sample(3)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day
129,2018-12-06,7413,13,6,2018,12,December,6
297,2019-12-02,5653,17,4,2019,12,December,2
692,2019-02-18,7419,16,1,2019,2,February,18

In [11]:
date['date_dow'] = date['date'].dt.dayofweek
date.sample(3)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow
67,2018-11-18,3604,16,5,2018,11,November,18,6
679,2019-11-11,4068,25,5,2019,11,November,11,0
615,2018-10-19,2846,22,3,2018,10,October,19,4

In [12]:
date['date_dow_name'] = date['date'].dt.day_name()
date.sample(3)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name
82,2019-10-26,1985,14,13,2019,10,October,26,5,Saturday
331,2019-10-21,6729,14,1,2019,10,October,21,0,Monday
83,2018-08-11,6300,22,5,2018,8,August,11,5,Saturday

In [13]:
date['is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday', 'Saturday']), 1, 0)
date.sample(3)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,is_weekend
895,2018-10-31,2714,28,8,2018,10,October,31,2,Wednesday,0
692,2019-02-18,7419,16,1,2019,2,February,18,0,Monday,0
28,2019-04-20,5501,16,1,2019,4,April,20,5,Saturday,1

#### 4. Extract week of year

In [14]:
date['date_week'] = date['date'].dt.isocalendar().week
date.sample(3)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,is_weekend,date_week
79,2019-05-17,420,26,1,2019,5,May,17,4,Friday,0,20
797,2019-03-17,4392,26,8,2019,3,March,17,6,Sunday,1,11
442,2019-06-04,963,13,1,2019,6,June,4,1,Tuesday,0,23

#### 5, Extract Quarter

In [15]:
date['quarter'] = date['date'].dt.quarter
date.sample(3)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,is_weekend,date_week,quarter
666,2019-03-19,7429,13,1,2019,3,March,19,1,Tuesday,0,12,1
187,2019-05-29,586,28,2,2019,5,May,29,2,Wednesday,0,22,2
225,2019-04-26,1503,21,12,2019,4,April,26,4,Friday,0,17,2

#### 6. Extract Semester

In [16]:
date['semester'] = np.where(date['quarter'].isin([1,2]), 1,2)
date.sample(3)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,is_weekend,date_week,quarter,semester
493,2019-06-04,2053,13,1,2019,6,June,4,1,Tuesday,0,23,2,1
477,2018-08-08,383,25,22,2018,8,August,8,2,Wednesday,0,32,3,2
467,2018-07-14,1114,13,90,2018,7,July,14,5,Saturday,1,28,3,2

### Extract Timelapse between dates

In [17]:
import datetime

today = datetime.datetime.today()
today

datetime.datetime(2026, 2, 16, 8, 30, 10, 687824)

In [18]:
today - date['date']

0     2260 days 08:30:10.687824
1     2742 days 08:30:10.687824
2     2673 days 08:30:10.687824
3     2375 days 08:30:10.687824
4     2598 days 08:30:10.687824
                 ...
995   2688 days 08:30:10.687824
996   2629 days 08:30:10.687824
997   2477 days 08:30:10.687824
998   2542 days 08:30:10.687824
999   2316 days 08:30:10.687824
Name: date, Length: 1000, dtype: timedelta64[ns]

In [19]:
(today - date['date']).dt.days

0      2260
1      2742
2      2673
3      2375
4      2598
       ...
995    2688
996    2629
997    2477
998    2542
999    2316
Name: date, Length: 1000, dtype: int64

### Working with Time

In [20]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [21]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [22]:
time['date'] = pd.to_datetime(time['date'])
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [23]:
time['hour'] = time['date'].dt.hour
time['minute'] = time['date'].dt.minute
time['second'] = time['date'].dt.second

time.head()

,date,msg,hour,minute,second
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [24]:
time['time'] = time['date'].dt.time
time.sample(3)

,date,msg,hour,minute,second,time
490,2014-08-18 22:55:00,ПАРЕНЬ ПОЗНАКОМЛЮСЬ С НОРМАЛЬНОЙ ДЕВУШКОЙ.18-2...,22,55,0,22:55:00
896,2013-08-23 01:13:00,СимпП29обм.инт.фото ласки по тел.сД/Ж.ИлиВстре...,1,13,0,01:13:00
64,2014-06-16 22:35:00,НАТАША ТЫ САМАЯ ЛУЧШАЯ РАД ЧТО ТЫ ЕСТЬ В МОЕЙ...,22,35,0,22:35:00